app/Controllers/Bidang.php

SELECT *
FROM `divisi`
---
	public function index()
	{

		$data = [
			'controller'    	=> ucwords('bidang'),
			'title'     		=> 'Data ' . ucwords('bidang'),
			'divisi'				=> $this->divisiModel->findAll()

SELECT `id_bidang`, `divisi`.`divisi`, `nama_bidang`
FROM `bidang`
JOIN `divisi` ON `bidang`.`divisi_id` = `divisi`.`id_divisi`
---
	public function getAllBidang()
	{
		$response = $data['data'] = array();

		// $result = $this->bidangModel->select('id_bidang,divisi.divisi,cabang.nama_cabang,nama_bidang')
		$result = $this->bidangModel->select('id_bidang,divisi.divisi,nama_bidang')
			->join('divisi', 'bidang.divisi_id = divisi.id_divisi')