app/Controllers/Dashboard.php

    public function index()
    {
        $data = [
            'title' => 'Dashboard',
            'bidang' => $this->bidangModel->findAll(),
---
SELECT *
FROM `bidang`