app/Controllers/Project.php

	public function index()
	{
		$data = [
			'controller'    	=> ucwords('project'),
			'title'     		=> 'Data ' . ucwords('project'),
			'bidang' 			=> $this->bidangModel->findAll()
---
SELECT *
FROM `bidang`

	public function getAll()
	{
		$data = [];
		date_default_timezone_set('Asia/Jakarta');
		$result = $this->projectModel->select('id_project,name_project,bidang_id,nama_pic,start,deadline,status,bidang.divisi_id,divisi.divisi,bidang.nama_bidang as nm_bidang')
			->join('bidang', 'bidang.id_bidang = project.bidang_id')
			->join('divisi', 'bidang.divisi_id = divisi.id_divisi')
			->findAll();
---
SELECT `id_project`, `name_project`, `bidang_id`, `nama_pic`, `start`, `deadline`, `status`, `bidang`.`divisi_id`, `divisi`.`divisi`, `bidang`.`nama_bidang` as `nm_bidang`
FROM `project`
JOIN `bidang` ON `bidang`.`id_bidang` = `project`.`bidang_id`
JOIN `divisi` ON `bidang`.`divisi_id` = `divisi`.`id_divisi`

	public function getKeterangan()
    {
        echo json_encode($this->keteranganprojectModel->where("project_id", $this->request->getPost('id_project'))->findAll());
---
SELECT *
FROM `keterangan_project`
WHERE `project_id` = '37'

	public function getOne()
	{
		$response = array();

		$id = $this->request->getPost('id_project');

		if ($this->validation->check($id, 'required|numeric')) {

			$data = $this->projectModel->where('id_project', $id)->first();
---
SELECT *
FROM `project`
WHERE `id_project` = '37'
 LIMIT 1