app/Models/ProjectModel.php

SELECT `bidang`.`nama_bidang` as `nm_bidang`, COUNT(project.id_project) as total_project_done
FROM `project`
JOIN `bidang` ON `bidang`.`id_bidang` = `project`.`bidang_id`
WHERE `status` = 1
GROUP BY `nama_bidang`
---
	public function get_project_done()
	{
		return $this->select("bidang.nama_bidang as nm_bidang, COUNT(project.id_project) as total_project_done")
			->where('status', 1)
			->join('bidang', 'bidang.id_bidang = project.bidang_id')
			->groupBy('nama_bidang')
			->get()->getResultArray();

SELECT `bidang`.`nama_bidang` as `nm_bidang`, COUNT(project.id_project) as total_project_progress
FROM `project`
JOIN `bidang` ON `bidang`.`id_bidang` = `project`.`bidang_id`
WHERE `status` = 0
GROUP BY `nama_bidang`
---
	public function get_project_progress()
	{
		return $this->select("bidang.nama_bidang as nm_bidang, COUNT(project.id_project) as total_project_progress")
			->where('status', 0)
			->join('bidang', 'bidang.id_bidang = project.bidang_id')
			->groupBy('nama_bidang')
			->get()->getResultArray();

SELECT `bidang`.`nama_bidang` as `nm_bidang`, COUNT(project.id_project) as totalProjectPasi
FROM `project`
JOIN `bidang` ON `bidang`.`id_bidang` = `project`.`bidang_id`
WHERE `bidang_id` = 35
GROUP BY `nama_bidang`
---
	public function getTotalProjectPASI()
	{
		return $this->select("bidang.nama_bidang as nm_bidang, COUNT(project.id_project) as totalProjectPasi")
			->where('bidang_id', 35)
			->join('bidang', 'bidang.id_bidang = project.bidang_id')
			->groupBy('nama_bidang')->get()->getResultArray();